; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=340, out_folder=./training, instance_id=22, seed=2046, goal_proportion=0.03

(define (problem blocksworld-22)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 - object)
 (:init 
    (arm-empty)
    (clear b69)
    (on b69 b328)
    (on b328 b64)
    (on b64 b173)
    (on-table b173)
    (clear b320)
    (on b320 b61)
    (on b61 b26)
    (on b26 b81)
    (on b81 b128)
    (on b128 b59)
    (on b59 b146)
    (on b146 b277)
    (on-table b277)
    (clear b190)
    (on b190 b228)
    (on b228 b288)
    (on-table b288)
    (clear b238)
    (on b238 b46)
    (on b46 b305)
    (on b305 b119)
    (on b119 b196)
    (on b196 b185)
    (on-table b185)
    (clear b227)
    (on-table b227)
    (clear b251)
    (on-table b251)
    (clear b222)
    (on-table b222)
    (clear b207)
    (on b207 b121)
    (on b121 b237)
    (on-table b237)
    (clear b252)
    (on b252 b172)
    (on b172 b118)
    (on-table b118)
    (clear b176)
    (on b176 b120)
    (on b120 b58)
    (on b58 b54)
    (on-table b54)
    (clear b201)
    (on-table b201)
    (clear b302)
    (on-table b302)
    (clear b276)
    (on b276 b304)
    (on b304 b116)
    (on b116 b220)
    (on b220 b314)
    (on-table b314)
    (clear b299)
    (on b299 b43)
    (on b43 b175)
    (on b175 b80)
    (on-table b80)
    (clear b70)
    (on b70 b193)
    (on-table b193)
    (clear b281)
    (on b281 b154)
    (on b154 b112)
    (on-table b112)
    (clear b135)
    (on b135 b317)
    (on b317 b278)
    (on-table b278)
    (clear b200)
    (on b200 b333)
    (on b333 b113)
    (on b113 b110)
    (on b110 b10)
    (on b10 b226)
    (on b226 b96)
    (on b96 b184)
    (on-table b184)
    (clear b311)
    (on b311 b3)
    (on b3 b174)
    (on b174 b197)
    (on b197 b283)
    (on b283 b147)
    (on b147 b124)
    (on-table b124)
    (clear b155)
    (on b155 b206)
    (on-table b206)
    (clear b57)
    (on b57 b66)
    (on-table b66)
    (clear b217)
    (on b217 b71)
    (on b71 b199)
    (on-table b199)
    (clear b105)
    (on-table b105)
    (clear b265)
    (on-table b265)
    (clear b122)
    (on-table b122)
    (clear b25)
    (on b25 b17)
    (on b17 b141)
    (on-table b141)
    (clear b12)
    (on b12 b300)
    (on b300 b88)
    (on-table b88)
    (clear b286)
    (on b286 b75)
    (on-table b75)
    (clear b262)
    (on-table b262)
    (clear b325)
    (on b325 b14)
    (on b14 b47)
    (on b47 b183)
    (on b183 b109)
    (on b109 b79)
    (on b79 b84)
    (on b84 b307)
    (on b307 b95)
    (on b95 b19)
    (on b19 b159)
    (on b159 b282)
    (on-table b282)
    (clear b73)
    (on b73 b309)
    (on b309 b77)
    (on b77 b29)
    (on-table b29)
    (clear b297)
    (on-table b297)
    (clear b142)
    (on b142 b230)
    (on b230 b249)
    (on b249 b235)
    (on b235 b335)
    (on b335 b284)
    (on b284 b218)
    (on-table b218)
    (clear b171)
    (on-table b171)
    (clear b308)
    (on b308 b48)
    (on-table b48)
    (clear b163)
    (on b163 b139)
    (on b139 b152)
    (on b152 b132)
    (on b132 b38)
    (on b38 b215)
    (on-table b215)
    (clear b149)
    (on-table b149)
    (clear b316)
    (on b316 b287)
    (on b287 b198)
    (on b198 b129)
    (on-table b129)
    (clear b165)
    (on-table b165)
    (clear b55)
    (on-table b55)
    (clear b269)
    (on-table b269)
    (clear b87)
    (on b87 b100)
    (on b100 b219)
    (on b219 b337)
    (on b337 b150)
    (on b150 b270)
    (on-table b270)
    (clear b76)
    (on b76 b90)
    (on-table b90)
    (clear b312)
    (on b312 b34)
    (on-table b34)
    (clear b52)
    (on b52 b212)
    (on b212 b67)
    (on b67 b136)
    (on b136 b107)
    (on b107 b157)
    (on b157 b313)
    (on b313 b21)
    (on b21 b49)
    (on b49 b211)
    (on b211 b97)
    (on-table b97)
    (clear b11)
    (on b11 b93)
    (on b93 b180)
    (on b180 b151)
    (on b151 b292)
    (on b292 b32)
    (on b32 b315)
    (on-table b315)
    (clear b263)
    (on-table b263)
    (clear b318)
    (on b318 b259)
    (on-table b259)
    (clear b234)
    (on b234 b274)
    (on b274 b104)
    (on b104 b225)
    (on b225 b241)
    (on b241 b319)
    (on b319 b231)
    (on b231 b98)
    (on-table b98)
    (clear b94)
    (on-table b94)
    (clear b204)
    (on b204 b247)
    (on-table b247)
    (clear b7)
    (on-table b7)
    (clear b254)
    (on b254 b158)
    (on b158 b117)
    (on-table b117)
    (clear b31)
    (on-table b31)
    (clear b243)
    (on b243 b223)
    (on-table b223)
    (clear b68)
    (on b68 b246)
    (on b246 b138)
    (on b138 b65)
    (on b65 b123)
    (on b123 b56)
    (on b56 b224)
    (on b224 b181)
    (on b181 b177)
    (on b177 b91)
    (on b91 b266)
    (on b266 b62)
    (on-table b62)
    (clear b27)
    (on b27 b133)
    (on b133 b321)
    (on-table b321)
    (clear b306)
    (on b306 b203)
    (on b203 b291)
    (on-table b291)
    (clear b82)
    (on b82 b229)
    (on b229 b83)
    (on-table b83)
    (clear b258)
    (on b258 b85)
    (on b85 b15)
    (on-table b15)
    (clear b244)
    (on b244 b78)
    (on b78 b8)
    (on-table b8)
    (clear b45)
    (on b45 b340)
    (on-table b340)
    (clear b261)
    (on-table b261)
    (clear b130)
    (on b130 b232)
    (on-table b232)
    (clear b166)
    (on-table b166)
    (clear b272)
    (on-table b272)
    (clear b126)
    (on b126 b255)
    (on b255 b22)
    (on b22 b23)
    (on b23 b131)
    (on b131 b233)
    (on b233 b134)
    (on-table b134)
    (clear b301)
    (on b301 b20)
    (on-table b20)
    (clear b164)
    (on b164 b195)
    (on b195 b179)
    (on b179 b36)
    (on b36 b72)
    (on b72 b86)
    (on-table b86)
    (clear b267)
    (on b267 b182)
    (on-table b182)
    (clear b37)
    (on b37 b18)
    (on b18 b125)
    (on-table b125)
    (clear b1)
    (on b1 b213)
    (on b213 b295)
    (on b295 b137)
    (on b137 b324)
    (on b324 b250)
    (on b250 b161)
    (on b161 b331)
    (on b331 b323)
    (on-table b323)
    (clear b257)
    (on-table b257)
    (clear b216)
    (on b216 b264)
    (on b264 b53)
    (on b53 b143)
    (on b143 b187)
    (on b187 b160)
    (on b160 b4)
    (on b4 b41)
    (on b41 b144)
    (on b144 b103)
    (on-table b103)
    (clear b294)
    (on b294 b178)
    (on b178 b108)
    (on b108 b338)
    (on b338 b35)
    (on b35 b205)
    (on b205 b111)
    (on-table b111)
    (clear b28)
    (on-table b28)
    (clear b334)
    (on b334 b99)
    (on b99 b9)
    (on b9 b13)
    (on b13 b336)
    (on-table b336)
    (clear b74)
    (on-table b74)
    (clear b189)
    (on b189 b329)
    (on-table b329)
    (clear b326)
    (on b326 b260)
    (on-table b260)
    (clear b339)
    (on b339 b42)
    (on b42 b290)
    (on b290 b289)
    (on b289 b186)
    (on b186 b40)
    (on b40 b332)
    (on b332 b145)
    (on b145 b191)
    (on b191 b245)
    (on b245 b310)
    (on b310 b210)
    (on b210 b148)
    (on b148 b188)
    (on b188 b39)
    (on-table b39)
    (clear b168)
    (on b168 b296)
    (on b296 b330)
    (on b330 b192)
    (on b192 b293)
    (on b293 b115)
    (on-table b115)
    (clear b298)
    (on b298 b242)
    (on-table b242)
    (clear b106)
    (on b106 b239)
    (on-table b239)
    (clear b221)
    (on b221 b51)
    (on b51 b273)
    (on b273 b248)
    (on-table b248)
    (clear b214)
    (on b214 b256)
    (on b256 b30)
    (on b30 b44)
    (on-table b44)
    (clear b279)
    (on b279 b24)
    (on b24 b114)
    (on b114 b236)
    (on b236 b60)
    (on b60 b303)
    (on b303 b280)
    (on-table b280)
    (clear b101)
    (on-table b101)
    (clear b50)
    (on-table b50)
    (clear b6)
    (on b6 b127)
    (on b127 b33)
    (on b33 b194)
    (on b194 b2)
    (on b2 b268)
    (on b268 b162)
    (on b162 b170)
    (on b170 b275)
    (on-table b275)
    (clear b271)
    (on b271 b202)
    (on b202 b16)
    (on b16 b92)
    (on b92 b153)
    (on b153 b5)
    (on b5 b167)
    (on b167 b240)
    (on b240 b322)
    (on b322 b140)
    (on-table b140)
    (clear b89)
    (on-table b89)
    (clear b253)
    (on b253 b63)
    (on b63 b102)
    (on-table b102)
    (clear b156)
    (on-table b156)
    (clear b209)
    (on b209 b169)
    (on b169 b327)
    (on-table b327)
    (clear b208)
    (on b208 b285)
    (on-table b285))
 (:goal  (and 
    (clear b7)
    (on b7 b3)
    (on b3 b8)
    (on b8 b1)
    (on b1 b6)
    (on b6 b9)
    (on-table b9)
    (clear b2)
    (on-table b2)
    (clear b5)
    (on b5 b4)
    (on b4 b10)
    (on-table b10))))

; plan
1. (unstack b200 b333)
   deleted: (on b200 b333) (clear b200) (arm-empty)
   added: (holding b200) (clear b333)
   goals met: 1 of 13
2. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 1 of 13
3. (unstack b216 b264)
   deleted: (on b216 b264) (clear b216) (arm-empty)
   added: (holding b216) (clear b264)
   goals met: 1 of 13
4. (putdown b216)
   deleted: (holding b216)
   added: (clear b216) (arm-empty) (on-table b216)
   goals met: 1 of 13
5. (unstack b244 b78)
   deleted: (on b244 b78) (clear b244) (arm-empty)
   added: (holding b244) (clear b78)
   goals met: 1 of 13
6. (putdown b244)
   deleted: (holding b244)
   added: (clear b244) (arm-empty) (on-table b244)
   goals met: 1 of 13
7. (unstack b264 b53)
   deleted: (on b264 b53) (clear b264) (arm-empty)
   added: (holding b264) (clear b53)
   goals met: 1 of 13
8. (putdown b264)
   deleted: (holding b264)
   added: (clear b264) (arm-empty) (on-table b264)
   goals met: 1 of 13
9. (unstack b271 b202)
   deleted: (on b271 b202) (clear b271) (arm-empty)
   added: (holding b271) (clear b202)
   goals met: 1 of 13
10. (putdown b271)
   deleted: (holding b271)
   added: (clear b271) (arm-empty) (on-table b271)
   goals met: 1 of 13
11. (unstack b202 b16)
   deleted: (on b202 b16) (clear b202) (arm-empty)
   added: (holding b202) (clear b16)
   goals met: 1 of 13
12. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 1 of 13
13. (unstack b16 b92)
   deleted: (on b16 b92) (clear b16) (arm-empty)
   added: (holding b16) (clear b92)
   goals met: 1 of 13
14. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 13
15. (unstack b311 b3)
   deleted: (on b311 b3) (clear b311) (arm-empty)
   added: (holding b311) (clear b3)
   goals met: 1 of 13
16. (putdown b311)
   deleted: (holding b311)
   added: (clear b311) (arm-empty) (on-table b311)
   goals met: 1 of 13
17. (unstack b333 b113)
   deleted: (on b333 b113) (clear b333) (arm-empty)
   added: (holding b333) (clear b113)
   goals met: 1 of 13
18. (putdown b333)
   deleted: (holding b333)
   added: (clear b333) (arm-empty) (on-table b333)
   goals met: 1 of 13
19. (unstack b113 b110)
   deleted: (on b113 b110) (clear b113) (arm-empty)
   added: (holding b113) (clear b110)
   goals met: 1 of 13
20. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 1 of 13
21. (unstack b110 b10)
   deleted: (on b110 b10) (clear b110) (arm-empty)
   added: (holding b110) (clear b10)
   goals met: 1 of 13
22. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 1 of 13
23. (unstack b10 b226)
   deleted: (on b10 b226) (clear b10) (arm-empty)
   added: (holding b10) (clear b226)
   goals met: 1 of 13
24. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 13
25. (unstack b334 b99)
   deleted: (on b334 b99) (clear b334) (arm-empty)
   added: (holding b334) (clear b99)
   goals met: 2 of 13
26. (putdown b334)
   deleted: (holding b334)
   added: (clear b334) (arm-empty) (on-table b334)
   goals met: 2 of 13
27. (unstack b53 b143)
   deleted: (on b53 b143) (clear b53) (arm-empty)
   added: (holding b53) (clear b143)
   goals met: 2 of 13
28. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 2 of 13
29. (unstack b143 b187)
   deleted: (on b143 b187) (clear b143) (arm-empty)
   added: (holding b143) (clear b187)
   goals met: 2 of 13
30. (putdown b143)
   deleted: (holding b143)
   added: (clear b143) (arm-empty) (on-table b143)
   goals met: 2 of 13
31. (unstack b187 b160)
   deleted: (on b187 b160) (clear b187) (arm-empty)
   added: (holding b187) (clear b160)
   goals met: 2 of 13
32. (putdown b187)
   deleted: (holding b187)
   added: (clear b187) (arm-empty) (on-table b187)
   goals met: 2 of 13
33. (unstack b160 b4)
   deleted: (on b160 b4) (clear b160) (arm-empty)
   added: (holding b160) (clear b4)
   goals met: 2 of 13
34. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 2 of 13
35. (unstack b78 b8)
   deleted: (on b78 b8) (clear b78) (arm-empty)
   added: (holding b78) (clear b8)
   goals met: 2 of 13
36. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 2 of 13
37. (unstack b92 b153)
   deleted: (on b92 b153) (clear b92) (arm-empty)
   added: (holding b92) (clear b153)
   goals met: 2 of 13
38. (putdown b92)
   deleted: (holding b92)
   added: (clear b92) (arm-empty) (on-table b92)
   goals met: 2 of 13
39. (unstack b153 b5)
   deleted: (on b153 b5) (clear b153) (arm-empty)
   added: (holding b153) (clear b5)
   goals met: 3 of 13
40. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 3 of 13
41. (unstack b99 b9)
   deleted: (on b99 b9) (clear b99) (arm-empty)
   added: (holding b99) (clear b9)
   goals met: 3 of 13
42. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 3 of 13
43. (unstack b9 b13)
   deleted: (on b9 b13) (clear b9) (arm-empty)
   added: (holding b9) (clear b13)
   goals met: 3 of 13
44. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 4 of 13
45. (unstack b6 b127)
   deleted: (on b6 b127) (clear b6) (arm-empty)
   added: (holding b6) (clear b127)
   goals met: 4 of 13
46. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 5 of 13
47. (unstack b127 b33)
   deleted: (on b127 b33) (clear b127) (arm-empty)
   added: (holding b127) (clear b33)
   goals met: 5 of 13
48. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 5 of 13
49. (unstack b33 b194)
   deleted: (on b33 b194) (clear b33) (arm-empty)
   added: (holding b33) (clear b194)
   goals met: 5 of 13
50. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 5 of 13
51. (unstack b194 b2)
   deleted: (on b194 b2) (clear b194) (arm-empty)
   added: (holding b194) (clear b2)
   goals met: 6 of 13
52. (putdown b194)
   deleted: (holding b194)
   added: (clear b194) (arm-empty) (on-table b194)
   goals met: 6 of 13
53. (unstack b2 b268)
   deleted: (on b2 b268) (clear b2) (arm-empty)
   added: (holding b2) (clear b268)
   goals met: 5 of 13
54. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 13
55. (unstack b1 b213)
   deleted: (on b1 b213) (clear b1) (arm-empty)
   added: (holding b1) (clear b213)
   goals met: 7 of 13
56. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 8 of 13
57. (unstack b3 b174)
   deleted: (on b3 b174) (clear b3) (arm-empty)
   added: (holding b3) (clear b174)
   goals met: 8 of 13
58. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 9 of 13
59. (unstack b4 b41)
   deleted: (on b4 b41) (clear b4) (arm-empty)
   added: (holding b4) (clear b41)
   goals met: 9 of 13
60. (stack b4 b10)
   deleted: (clear b10) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b10)
   goals met: 10 of 13
61. (unstack b5 b167)
   deleted: (on b5 b167) (clear b5) (arm-empty)
   added: (holding b5) (clear b167)
   goals met: 9 of 13
62. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 11 of 13
63. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 10 of 13
64. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 10 of 13
65. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 10 of 13
66. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 11 of 13
67. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 11 of 13
68. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 12 of 13
69. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 11 of 13
70. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 13 of 13
